Revit 2027 API
PipeFittingAndAccessoryConnectorData.FlowDirection Property
 The flow direction of this connector, In or Out.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FlowDirectionType FlowDirection { get; }
Public ReadOnly Property FlowDirection As FlowDirectionType
	Get
public:
property FlowDirectionType FlowDirection {
	FlowDirectionType get ();
}
member FlowDirection : FlowDirectionType with get
Property Value
FlowDirectionType
See Also
Reference
PipeFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Plumbing Namespace